[
    {
        "word": "Wheedle",
        "meanings": [
            "1. To use flattery or coaxing to persuade someone to do something or give one something: She managed to wheedle an extra piece of cake from her mother by complimenting her cooking skills.",
            "2. To employ subtle or flattery to achieve a goal: He tried to wheedle his way into the VIP section by charming the event organizer."
        ],
        "synonyms": [
            "Coax",
            "Persuade",
            "Flatter",
            "Influence",
            "Cajole"
        ],
        "antonyms": [
            "Insist",
            "Demand",
            "Coerce",
            "Compel"
        ],
        "note": ""
    },
    {
        "word": "Back-stop",
        "meanings": [
            "1. A person or thing placed at the rear of or behind something as a support or barrier: The fence acted as a back-stop to prevent the ball from going out of the field.",
            "2. A secondary or last-resort measure, often used to provide security or support: The government introduced a back-stop plan to support the economy in case the primary measures fail.",
            "3. In baseball, the fence or structure behind the catcher that prevents the ball from going too far if it isn't caught: The back-stop was crucial in preventing wild pitches from causing problems.",
            "4. A financial arrangement that provides insurance or guarantees support, typically in case of default or failure: The company secured a back-stop agreement to ensure they had the necessary funds if the main investor pulled out."
        ],
        "synonyms": [
            "Support",
            "Safeguard",
            "Security",
            "Cushion",
            "Reserve"
        ],
        "antonyms": [
            "Risk",
            "Exposure",
            "Weakness"
        ],
        "note": ""
    },
    {
        "word": "To mount",
        "meanings": [
            "1. To go up or climb: She carefully mounted the stairs, holding onto the railing for support.",
            "2. To increase or grow in quantity, intensity, or degree: Tensions between the two countries mounted as negotiations failed.",
            "3. To organize and launch, especially in relation to a campaign or event: The activists mounted a campaign to raise awareness about climate change.",
            "4. To place or fix on a raised surface, such as for display or use: The artist mounted the painting on the gallery wall.",
            "5. To prepare and put in place for use, such as mounting a horse or bicycle: He mounted his horse and rode off into the distance."
        ],
        "synonyms": [
            "Ascend",
            "Climb",
            "Increase",
            "Organize",
            "Set up"
        ],
        "antonyms": [
            "Descend",
            "Dismount",
            "Decrease",
            "Dismantle",
            "Disassemble"
        ],
        "note": ""
    },
    {
        "word": "Burgeon",
        "meanings": [
            "1. To grow or develop rapidly; flourish: The tech industry continues to burgeon, with new startups emerging every day.",
            "2. To begin to grow or increase quickly: Interest in renewable energy sources is beginning to burgeon as people become more environmentally conscious."
        ],
        "synonyms": [
            "Flourish",
            "Thrive",
            "Expand",
            "Proliferate",
            "Blossom"
        ],
        "antonyms": [
            "Decline",
            "Diminish",
            "Shrink",
            "Wither",
            "Recede"
        ],
        "note": ""
    },
    {
        "word": "Flabby",
        "meanings": [
            "1. Soft, loose, and lacking firmness, often used to describe muscles or tissue: After months without exercise, his arms became flabby and weak.",
            "2. Lacking strength, force, or effectiveness; weak: The movie's plot was flabby, with too many unnecessary scenes."
        ],
        "synonyms": [
            "Soft",
            "Saggy",
            "Weak",
            "Feeble",
            "Unfirm"
        ],
        "antonyms": [
            "Firm",
            "Toned",
            "Strong",
            "Muscular",
            "Solid"
        ],
        "note": ""
    },
    {
        "word": "Paltry",
        "meanings": [
            "1. Small or meager in amount, often considered insignificant or insufficient: She was disappointed with the paltry sum of money she received as a bonus.",
            "2. Lacking in importance or worth; trivial: The committee dismissed his paltry complaints as unimportant.",
            "3. Inferior or contemptible; of poor quality: The paltry service at the restaurant left much to be desired."
        ],
        "synonyms": [
            "Meager",
            "Trivial",
            "Insignificant",
            "Petty",
            "Inadequate"
        ],
        "antonyms": [
            "Substantial",
            "Significant",
            "Considerable",
            "Generous",
            "Important"
        ],
        "note": ""
    },
    {
        "word": "Curative",
        "meanings": [
            "1. Able to cure disease or restore health; healing: The doctor prescribed a curative treatment that would help alleviate the patient's symptoms.",
            "2. Serving to remedy or correct a problem or deficiency: The new policy acted as a curative measure for the company’s declining profits."
        ],
        "synonyms": [
            "Healing",
            "Therapeutic",
            "Restorative",
            "Medicinal",
            "Remedial"
        ],
        "antonyms": [
            "Harmful",
            "Detrimental",
            "Damaging",
            "Injurious",
            "Worsening"
        ],
        "note": ""
    },
    {
        "word": "Salutary",
        "meanings": [
            "1. Producing good effects; beneficial, especially when referring to something unwelcome or unpleasant that results in a positive outcome: Although the criticism was harsh, it had a salutary effect on her work, pushing her to improve.",
            "2. Promoting health; healthful: The doctor recommended a salutary diet rich in fruits and vegetables."
        ],
        "synonyms": [
            "Beneficial",
            "Healthful",
            "Advantageous",
            "Wholesome",
            "Constructive"
        ],
        "antonyms": [
            "Harmful",
            "Detrimental",
            "Unfavorable",
            "Unwholesome",
            "Adverse"
        ],
        "note": ""
    },
    {
        "word": "Robust",
        "meanings": [
            "1. Strong and healthy; vigorous: The farmer maintained a robust physique due to years of hard work in the fields.",
            "2. Sturdy and resilient; able to withstand or overcome adverse conditions: The company’s robust financial plan helped it survive the economic downturn.",
            "3. Full-bodied and rich in flavor, often used to describe food or drink: The coffee had a robust flavor that was both strong and satisfying.",
            "4. Forceful and determined; showing confidence and strength: The politician delivered a robust defense of her policies during the debate."
        ],
        "synonyms": [
            "Strong",
            "Sturdy",
            "Vigorous",
            "Resilient",
            "Hearty"
        ],
        "antonyms": [
            "Weak",
            "Fragile",
            "Feeble",
            "Delicate",
            "Frail"
        ],
        "note": ""
    },
    {
        "word": "Vulnerary",
        "meanings": [
            "1. Used for or useful in healing wounds; having healing properties: The herbal ointment was known for its vulnerary qualities, helping cuts and bruises to heal faster.",
            "2. Relating to the treatment of wounds: The vulnerary balm was applied to the soldier's injuries to promote healing."
        ],
        "synonyms": [
            "Healing",
            "Medicinal",
            "Curative",
            "Therapeutic",
            "Restorative"
        ],
        "antonyms": [
            "Harmful",
            "Injurious",
            "Damaging",
            "Detrimental",
            "Aggravating"
        ],
        "note": ""
    },
    {
        "word": "Inimical",
        "meanings": [
            "1. Tending to obstruct or harm; unfavorable or hostile: The harsh climate was inimical to the growth of most plants in the region.",
            "2. Unfriendly or hostile in nature or effect: His inimical attitude towards his colleagues made the work environment tense and uncomfortable."
        ],
        "synonyms": [
            "Hostile",
            "Unfriendly",
            "Adverse",
            "Detrimental",
            "Antagonistic"
        ],
        "antonyms": [
            "Friendly",
            "Supportive",
            "Favorable",
            "Beneficial",
            "Amicable"
        ],
        "note": ""
    },
    {
        "word": "Invigorating",
        "meanings": [
            "1. Providing energy or vitality; stimulating: A brisk morning jog is invigorating and helps me start the day with more energy.",
            "2. Refreshing and making one feel more lively or active: The cool, crisp air of the mountain was invigorating after the stuffy city environment."
        ],
        "synonyms": [
            "Energizing",
            "Refreshing",
            "Stimulating",
            "Revitalizing",
            "Rejuvenating"
        ],
        "antonyms": [
            "Exhausting",
            "Draining",
            "Fatiguing",
            "Depleting",
            "Enervating"
        ],
        "note": ""
    }
]